src/Documents/ПисьмоОбменСБанками/ПисьмоОбменСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПисьмоОбменСБанками</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>DefinedType.БанкОбменСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПисьма</name>
    <type>
      <types>CatalogRef.ТипыПисемОбменСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ВладелецОбменСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.СчетОрганизацииОбменСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбменСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВалютногоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПереписки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсходногоПисьма</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПисьмоОбменСБанками/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИсходящийНомер) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПисьмоОбменСБанками.ИсходящийНомер) КАК ИсходящийНомер
		|ИЗ
		|	Документ.ПисьмоОбменСБанками КАК ПисьмоОбменСБанками
		|ГДЕ
		|	ПисьмоОбменСБанками.Организация = &Организация
		|	И ПисьмоОбменСБанками.Банк = &Банк";
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Банк", Банк);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() И ЗначениеЗаполнено(Результат.ИсходящийНомер) Тогда
			ИсходящийНомер = Результат.ИсходящийНомер + 1;
		Иначе
			ИсходящийНомер = 1;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторПереписки) Тогда
		ИдентификаторПереписки = Новый УникальныйИдентификатор
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторИсходногоПисьма)
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ПисьмоОбменСБанками") Тогда
		ИдентификаторИсходногоПисьма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Идентификатор");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = Новый УникальныйИдентификатор
	КонецЕсли;

КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СинхронизироватьПометкуУдаленияПрисоединенныхФайлов();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СинхронизироватьПометкуУдаленияПрисоединенныхФайлов()  
	
	ПометкаУдаленияОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ПометкаУдаления");
	
	ПрисоединенныеФайлы = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Ссылка, ПрисоединенныеФайлы);  
	
	СведенияОПрисоединенныхФайлах = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ПрисоединенныеФайлы,"ПометкаУдаления");  
	Для Каждого СведенияОФайле Из СведенияОПрисоединенныхФайлах Цикл 
		Если СведенияОФайле.Значение.ПометкаУдаления = ПометкаУдаленияОбъекта Тогда
			Продолжить;
		КонецЕсли;
		
		ФайлОбъект = СведенияОФайле.Ключ.ПолучитьОбъект();
		Попытка  
			ЗаблокироватьДанныеДляРедактирования(СведенияОФайле.Ключ);
			ФайлОбъект.УстановитьПометкуУдаления(ПометкаУдаленияОбъекта);
		Исключение 
			// записать предупреждение в журнал регистрации
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обработка пометки на удаление присоединенного файла';
											|en = 'Attachment deletion mark processing'", 
			ОбщегоНазначения.КодОсновногоЯзыка()),     
			УровеньЖурналаРегистрации.Ошибка,
			,
			ФайлОбъект, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
